[
  {
    "id": 1,
    "name": "Record-Reveal",
    "techUsed": "Html, Css, JavaScript",
    "type": "Game",
    "description": "Record Reveal is a simple game where the player must pick squares and try and match their contents.  A correct guess awards points and reveals part of an album cover that is being pulled from the discogs API.  Your scores are stored in local storage so you can keep trying to beat your Hi-Score!",
    "images": {
      "sm": "https://i.imgur.com/V3xy5eI.jpg",
      "lg": "https://i.imgur.com/V3xy5eI.jpg"
    }
  },
  {
    "id": 2,
    "name": "Backlog",
    "techUsed": {
      "frontEnd": "React, CSS, JavaScript",
      "backEnd": "MongoDB, Mongoose, Express"
    },
    "type": "Game Management",
    "description": "Backlog aims to help you keep track of your library of games by sorting them into catagories of 'Not Started', 'In Progress', and 'Completed'. You are also able to add notes to the games in your library, so if you decide to take a break from one game and start another. This will make it easier to come back to a game later on and have useful information to look at.",
    "images": {
      "sm": "https://i.imgur.com/UZFP35o.png",
      "lg": "https://i.imgur.com/baltRWl.png"
    }
  },
  {
    "id": 3,
    "name": "Work-Track",
    "techUsed": {
      "frontEnd": "React, CSS, JavaScript",
      "backEnd": "PSQL, Express, Sequelize, JWT Auth"
    },
    "type": "Time Management",
    "description": "WorkTrackApp is here for your project management and tracking needs. Create an account. Add your business, positions, and employees to start tracking immediately! Easily pull up records for a range of dates and see how many worker hours were logged over the time period. WorkTrack is designed to make managing your employees simple & efficient.  This was a group project that we were able to spin up in a week.  Credit to my teammates, Bryan Sanchez and Jason McCoy.",
    "images": {
      "sm": "https://i.imgur.com/U4rjsan.png",
      "lg": "https://i.imgur.com/HI4pEGe.png"
    }
  }
]
